In [1]:
import pandas as pd

## pandas

In [2]:
# pandas is a python library used for working with data sets

# it has functions for analysing,cleaning,exploring and manipulating data

# pandas allows us to analyse big data and make conclusion based on statisticall theories

# pandas can clean messy data sets,and make them readable and relevant

# relevant data is very important in data sciencee

# in pandas one dimension is called series,
# 2 dim is called data frame,
# 3d is called panel

### Series

##### creating a series from array

In [3]:
import pandas as pd

import numpy as np

x = np.array([1,2,3,4,5,6])

x

array([1, 2, 3, 4, 5, 6])

In [4]:
s = pd.Series(x)

s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
print(s.shape)   #to find the rows and columns 

print(s.dtype)

print(s.ndim)

print(type(s))

(6,)
int64
1
<class 'pandas.core.series.Series'>

In [6]:
# creating a two dimensional array

In [9]:
x = np.random.randint(10,size=(7))

x

array([3, 2, 7, 3, 0, 2, 5])

In [10]:
s = pd.Series(x)  #we cant create a series with 2d array

In [11]:
s

0    3
1    2
2    7
3    3
4    0
5    2
6    5
dtype: int64

##### creating a series from array and providing index

In [12]:
x = pd.np.random.randint(50,size=10)

x

/tmp/ipykernel_8606/3820119330.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead.
  x = pd.np.random.randint(50,size=10)

array([20, 19, 22,  7, 45, 31, 36, 20, 36, 36])

In [13]:
s = pd.Series(x,index=['a',100,101,102,3,4,5,6,'s','o']) #index must be given equal to no. of elements in array

s

a      20
100    19
101    22
102     7
3      45
4      31
5      36
6      20
s      36
o      36
dtype: int64

##### creating a series using dictionary

In [14]:
# creating a dictionary #the key of the dictionary is index and value is the fisrt column

dict = {'a':1,'b':2,'c':3,'d':4}

s = pd.Series(dict)

s

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
#creating a dict and convert to series and assign index

dict = {'a':1,'b':2,'c':3,'d':4}

s = pd.Series(dict,index=['a','b','c','d','e']) #since we added extra index the data inside is auto filled as NaN

s

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

##### Nan datatype

In [16]:
#NaN or void  datatype if the index not exist or given different value from index 

# Not a number

##### creating a constant series

In [17]:
s = pd.Series(3,)

s   #only series with one value will be created

0    3
dtype: int64

In [18]:
s=pd.Series(3,index=[1,2,3,4,5])

s

1    3
2    3
3    3
4    3
5    3
dtype: int64

##### creating a series using list

In [19]:
s = pd.Series([1,2,3,4,5])

s

0    1
1    2
2    3
3    4
4    5
dtype: int64

##### creating a series using list and assigning index

In [20]:
s = pd.Series([1,2,3,4],index=['a','b','c','d'])

s

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
print(s[0]) #if the index is mixed with int and string we will get an error

print(s[2])

print(s['a'])

print(s['d'])

1
3
1
4

##### slicing and indexing in Series

In [22]:
# slicing

In [23]:
print(s['a':])

print(s[::-1])

a    1
b    2
c    3
d    4
dtype: int64
d    4
c    3
b    2
a    1
dtype: int64

In [24]:
print(s[0:3])

print(s[1:3])

a    1
b    2
c    3
dtype: int64
b    2
c    3
dtype: int64

In [25]:
print(s[['a','b']])

print(s[['a','d']])

a    1
b    2
dtype: int64
a    1
d    4
dtype: int64

### Data frame

##### creating and empty data frame

In [26]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [27]:
l1 =[1,2,3,4,5,6,7,8]

df = pd.DataFrame(l1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [28]:
df.shape

(8, 1)

In [29]:
df.dtypes  #in dataframe has more than one series so datatypes

0    int64
dtype: object

In [30]:
rows,columns=df.shape

In [31]:
rows

8

In [32]:
columns

1

In [33]:
df.ndim

2

In [34]:
type(df)

pandas.core.frame.DataFrame

##### creating a dataframe from nested list

In [35]:
l1 =[['vyshak',2,100],['Rahul',4,'m'],['afrts',6,7]]

In [36]:
df = pd.DataFrame(l1,columns=["name","roll","marks"]) #columns to give column name
df

     name  roll marks
0  vyshak     2   100
1   Rahul     4     m
2   afrts     6     7

In [37]:
df.shape

(3, 3)

##### creating a adataframe and assigning index

In [38]:
df = pd.DataFrame(l1,index=['name','name1','name2'])  #index to give row name
df

            0  1    2
name   vyshak  2  100
name1   Rahul  4    m
name2   afrts  6    7

##### creating a dataframe from dictionary

In [39]:
data ={'name':['Rahul','Vyshak','Ajith'],'mark':[100,1,70]}

In [40]:
#each key value pair in the dictionay represent one column of the dataframe

In [41]:
df = pd.DataFrame(data)
df

     name  mark
0   Rahul   100
1  Vyshak     1
2   Ajith    70

##### creating dataframe of 4 coloum name physics,maths,chem

In [42]:
dict = {'name':['Rahul','Vyshak','Salih','Hafiz'],'Physics':[80,70,76,74],'Chemistry':[100,30,67,89],'maths':[60,100,50,37]}

In [43]:
df = pd.DataFrame(dict)
df

     name  Physics  Chemistry  maths
0   Rahul       80        100     60
1  Vyshak       70         30    100
2   Salih       76         67     50
3   Hafiz       74         89     37

##### to add new column #similar to dictionary

In [44]:
df['Biology']=[70,50,50,60]
df

     name  Physics  Chemistry  maths  Biology
0   Rahul       80        100     60       70
1  Vyshak       70         30    100       50
2   Salih       76         67     50       50
3   Hafiz       74         89     37       60

##### row wise addition to add value to the added column

In [45]:
df['Total']=df['Physics']+df['Chemistry']+df['maths']+df['Biology']
df

     name  Physics  Chemistry  maths  Biology  Total
0   Rahul       80        100     60       70    310
1  Vyshak       70         30    100       50    250
2   Salih       76         67     50       50    243
3   Hafiz       74         89     37       60    260

In [46]:
df['Physics']

0    80
1    70
2    76
3    74
Name: Physics, dtype: int64

In [47]:
df['maths']

0     60
1    100
2     50
3     37
Name: maths, dtype: int64

#### to delete a column

##### del method

In [48]:
del df['Total']
df

     name  Physics  Chemistry  maths  Biology
0   Rahul       80        100     60       70
1  Vyshak       70         30    100       50
2   Salih       76         67     50       50
3   Hafiz       74         89     37       60

##### drop # should save to variable prior

In [49]:
df = df.drop('Physics',axis=1) #axis=1 must be given to delete column wise
df

     name  Chemistry  maths  Biology
0   Rahul        100     60       70
1  Vyshak         30    100       50
2   Salih         67     50       50
3   Hafiz         89     37       60

##### pop method

In [50]:
df.pop('maths')
df

     name  Chemistry  Biology
0   Rahul        100       70
1  Vyshak         30       50
2   Salih         67       50
3   Hafiz         89       60

In [51]:
# these method shall be used in data cleaning

In [52]:
# to delete a row set axis =0

In [53]:
#new

In [54]:
dict = {'name':['Mercedes','Maruti',]}

### Data frame 2

In [55]:
import pandas as pd

In [56]:
data = {"name":["a","b","c","d","e"],"age":[1,2,3,4,5]}

In [57]:
df = pd.DataFrame(data)
df

  name  age
0    a    1
1    b    2
2    c    3
3    d    4
4    e    5

##### head default to display first 5 elements

In [58]:
df.head(2)

  name  age
0    a    1
1    b    2

##### tail to display last 5 elements

In [59]:
df.tail(2)

  name  age
3    d    4
4    e    5

##### .values

In [60]:
df.values    #will display the array of values

array([['a', 1],
       ['b', 2],
       ['c', 3],
       ['d', 4],
       ['e', 5]], dtype=object)

##### .value_counts

In [61]:
df.value_counts()  #we get the count of each element the method used inSeries

name  age
a     1      1
b     2      1
c     3      1
d     4      1
e     5      1
dtype: int64

##### .empty

In [62]:
df.empty  #to check weather the df is empty or not, returns boolean output

False

##### .size

In [63]:
df.size  #total count of key and value

10

#### Math operation

In [64]:
#creating a dataframe

In [65]:
dict = {'name':['Rahul','Vyshak','Salih','Hafiz'],'Physics':[80,70,76,74],'Chemistry':[100,30,67,89],'maths':[60,100,50,37]}

In [66]:
df = pd.DataFrame(dict)
df

     name  Physics  Chemistry  maths
0   Rahul       80        100     60
1  Vyshak       70         30    100
2   Salih       76         67     50
3   Hafiz       74         89     37

##### .sum()

In [67]:
df["Physics"].sum()  # returns the sum of physics column

300

##### .max()

In [68]:
df["Chemistry"].max()  #returns the max of chemistry

100

##### .mean()

In [69]:
df["maths"].mean()  #average of the maths

61.75

##### .describe

In [70]:
df.describe()  # to give overall statistical data

         Physics   Chemistry       maths
count   4.000000    4.000000    4.000000
mean   75.000000   71.500000   61.750000
std     4.163332   30.881494   27.183022
min    70.000000   30.000000   37.000000
25%    73.000000   57.750000   46.750000
50%    75.000000   78.000000   55.000000
75%    77.000000   91.750000   70.000000
max    80.000000  100.000000  100.000000

In [71]:
df.sum()  #to display sum of all the subject col wise

name         RahulVyshakSalihHafiz
Physics                        300
Chemistry                      286
maths                          247
dtype: object

In [72]:
df.sum(axis=1)      #row wise sum

/tmp/ipykernel_8606/321158044.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)      #row wise sum

0    240
1    200
2    193
3    200
dtype: int64

In [73]:
df.sum(0)   #column wise dwfault

name         RahulVyshakSalihHafiz
Physics                        300
Chemistry                      286
maths                          247
dtype: object

In [74]:
df.mean()   #complete mean per column wise

/tmp/ipykernel_8606/2181369396.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()   #complete mean per column wise

Physics      75.00
Chemistry    71.50
maths        61.75
dtype: float64

In [75]:
df.mean(1)  #row wise mean

/tmp/ipykernel_8606/2333321949.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(1)  #row wise mean

0    80.000000
1    66.666667
2    64.333333
3    66.666667
dtype: float64

In [76]:
df.mode()

     name  Physics  Chemistry  maths
0   Hafiz       70         30     37
1   Rahul       74         67     50
2   Salih       76         89     60
3  Vyshak       80        100    100

In [77]:
df["Physics"].mode()

0    70
1    74
2    76
3    80
Name: Physics, dtype: int64

##### .count()

In [78]:
df.count()  #to display values in each columns #count of columns

name         4
Physics      4
Chemistry    4
maths        4
dtype: int64

In [79]:
df.count(1)   #row wisw count  #count of indexes

0    4
1    4
2    4
3    4
dtype: int64

In [80]:
df.std()

/tmp/ipykernel_8606/3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Physics       4.163332
Chemistry    30.881494
maths        27.183022
dtype: float64

In [81]:
df.std(1)

/tmp/ipykernel_8606/1522973453.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(1)

0    20.000000
1    35.118846
2    13.203535
3    26.764404
dtype: float64

In [82]:
df.max()

name         Vyshak
Physics          80
Chemistry       100
maths           100
dtype: object

In [83]:
df.min()

name         Hafiz
Physics         70
Chemistry       30
maths           37
dtype: object

In [84]:
df.prod()  #multiplication #same do for axis wise

/tmp/ipykernel_8606/437129201.py:1: FutureWarning: The default value of numeric_only in DataFrame.prod is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.prod()  #multiplication #same do for axis wise

Physics      31494400
Chemistry    17889000
maths        11100000
dtype: int64

In [85]:
df.cumsum()

                    name  Physics  Chemistry  maths
0                  Rahul       80        100     60
1            RahulVyshak      150        130    160
2       RahulVyshakSalih      226        197    210
3  RahulVyshakSalihHafiz      300        286    247

In [86]:
#cumilative sum at last row we will get sum of 4 people

In [87]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

#### pipe

In [88]:
def adder(a,b):
    return a+b

In [89]:
# series_name=series_name.pipe(fuction,arg_value)

In [90]:
s = s.pipe(adder,10) #pipe used to run function inside series, will run the function on entire element
s

0    11
1    12
2    13
3    14
dtype: int64

In [91]:
data = [[1,4,5],[1,4,5],[3,6,7]]

In [92]:
df = pd.DataFrame(data,columns=["col1","col2","col3"])
df

   col1  col2  col3
0     1     4     5
1     1     4     5
2     3     6     7

In [93]:
df.pipe(adder,20)  #will add 20 to all columns

   col1  col2  col3
0    21    24    25
1    21    24    25
2    23    26    27

In [94]:
def adder(a,b,c):
    return a+b+c   #change the function

In [95]:
df.pipe(adder,20,10)

   col1  col2  col3
0    31    34    35
1    31    34    35
2    33    36    37

#### apply

In [96]:
def sqr(a):
    return a**2

In [97]:
s = pd.Series([1,2,3,4,5,6,7,8])

In [98]:
s.apply(sqr)   #apply a var to save to variable #cannot apply axis since series one dim

0     1
1     4
2     9
3    16
4    25
5    36
6    49
7    64
dtype: int64

In [99]:
df

   col1  col2  col3
0     1     4     5
1     1     4     5
2     3     6     7

In [100]:
df.apply(sqr)

   col1  col2  col3
0     1    16    25
1     1    16    25
2     9    36    49

In [101]:
df.apply(sqr,axis =1)

   col1  col2  col3
0     1    16    25
1     1    16    25
2     9    36    49

In [102]:

df.apply(sqr,axis=0)

   col1  col2  col3
0     1    16    25
1     1    16    25
2     9    36    49

In [103]:
import numpy as np

In [104]:
# to find mean we have to import numpy

In [105]:
df.apply(np.mean,axis=0)   #column wise

col1    1.666667
col2    4.666667
col3    5.666667
dtype: float64

In [106]:
df.apply(np.mean,axis=1) #row wise

0    3.333333
1    3.333333
2    5.333333
dtype: float64

In [107]:
df.apply(lambda x: x**2,axis=0)

   col1  col2  col3
0     1    16    25
1     1    16    25
2     9    36    49

In [108]:
df

   col1  col2  col3
0     1     4     5
1     1     4     5
2     3     6     7

In [109]:
df.apply(lambda x: x.max()- x.min(),axis=1)  #row wise 5-1

0    4
1    4
2    4
dtype: int64

In [110]:
df.apply(lambda x: x.max()-x.min())   #default axis column wise

col1    2
col2    2
col3    2
dtype: int64

#### apply map

In [111]:
#creating a dataframe

In [112]:
df

   col1  col2  col3
0     1     4     5
1     1     4     5
2     3     6     7

In [113]:
df.applymap(lambda x: x*100)

   col1  col2  col3
0   100   400   500
1   100   400   500
2   300   600   700

In [114]:
# values multiplied by 100

In [115]:
#we can seperate a column and apply the function

In [116]:
df["col1"].map(lambda x:x*100)

0    100
1    100
2    300
Name: col1, dtype: int64

In [117]:
# slicing inside dataframw

In [118]:
# loc[] and iloc[]

In [119]:
# pipe(): Table wise function applications in Pandas
# apply(): Row or column wise function operatio
# # applymap(): Element-wise function applications In Pandas

### slicing and indexing of dataframe

In [120]:
import numpy as np
import pandas as pd

In [121]:
data = [[1,2,3],[4,5,6],[7,8,9],[11,12,13]]

In [122]:
dfa = pd.DataFrame(data,columns=["a","b","c"],index=[1,2,3,4])

In [123]:
dfa

    a   b   c
1   1   2   3
2   4   5   6
3   7   8   9
4  11  12  13

In [125]:
dfa['a']

1     1
2     4
3     7
4    11
Name: a, dtype: int64

#### loc

In [127]:
df.loc[1]  #will locate at index==1

col1    1
col2    4
col3    5
Name: 1, dtype: int64

In [129]:
dfa[["a","b"]]

    a   b
1   1   2
2   4   5
3   7   8
4  11  12

In [130]:
dfa.a

1     1
2     4
3     7
4    11
Name: a, dtype: int64

In [131]:
dfa[["a","c","b"]]

    a   c   b
1   1   3   2
2   4   6   5
3   7   9   8
4  11  13  12

In [132]:
dfa["d"]=[2,4,6,7]

In [134]:
dfa

    a   b   c  d
1   1   2   3  2
2   4   5   6  4
3   7   8   9  6
4  11  12  13  7

In [135]:
df1=df.loc[1:3,"b":"d"]   #to slice the columns

In [136]:
df1

   col1  col2  col3
1     1     4     5
2     3     6     7

#### iloc  #set index number

In [137]:
df2=df.iloc[0:2,1:]
df2

   col2  col3
0     4     5
1     4     5

In [138]:
df2

   col2  col3
0     4     5
1     4     5

In [139]:
df = pd.read_csv("http://bit.ly/imdbratings")

In [140]:
df.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [141]:
df2 = df.iloc[0:5,0:2]  #notice the index

In [142]:
df2

   star_rating                     title
0          9.3  The Shawshank Redemption
1          9.2             The Godfather
2          9.1    The Godfather: Part II
3          9.0           The Dark Knight
4          8.9              Pulp Fiction

In [143]:
# using loc

In [144]:
df3 = df.loc[0:4,"star_rating":"genre"]

In [145]:
df3

   star_rating                     title content_rating   genre
0          9.3  The Shawshank Redemption              R   Crime
1          9.2             The Godfather              R   Crime
2          9.1    The Godfather: Part II              R   Crime
3          9.0           The Dark Knight          PG-13  Action
4          8.9              Pulp Fiction              R   Crime

In [146]:
df4 = df.loc[1:6,["star_rating","content_rating","actors_list"]]

In [147]:
df4

,star_rating,content_rating,actors_list
1,9.2,R,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,R,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,PG-13,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,R,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
5,8.9,NOT RATED,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,NOT RATED,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."

In [148]:
df5 = df.iloc[1:6,[1,3,5]]

In [149]:
df5

,title,genre,actors_list
1,The Godfather,Crime,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,The Godfather: Part II,Crime,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,The Dark Knight,Action,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,Pulp Fiction,Crime,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
5,12 Angry Men,Drama,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."

In [150]:
df["c"]=10

In [151]:
df

,star_rating,title,content_rating,genre,duration,actors_list,c
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",10
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",10
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",10
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",10
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L....",10
...,...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G...",10
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma...",10
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo...",10
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr...",10
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar...",10

In [152]:
dfa["a"]=10  #to replace column a completely

In [153]:
dfa

    a   b   c  d
1  10   2   3  2
2  10   5   6  4
3  10   8   9  6
4  10  12  13  7

In [154]:
dfa.loc[:,"c"]=11

In [155]:
dfa

    a   b   c  d
1  10   2  11  2
2  10   5  11  4
3  10   8  11  6
4  10  12  11  7

In [156]:
df.iloc[[0,3,6],[0,2]] #multiple sort

   star_rating content_rating
0          9.3              R
3          9.0          PG-13
6          8.9      NOT RATED

In [157]:
df.iloc[0:5]

,star_rating,title,content_rating,genre,duration,actors_list,c
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",10
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",10
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",10
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",10
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L....",10

In [158]:
df.head(4)

,star_rating,title,content_rating,genre,duration,actors_list,c
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",10
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",10
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",10
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",10

In [159]:
#crea

In [160]:
data = pd.np.random.randint(50,size=(8,4))

/tmp/ipykernel_8606/3528532875.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead.
  data = pd.np.random.randint(50,size=(8,4))

In [161]:
df = pd.DataFrame(data)

In [162]:
df

    0   1   2   3
0  32  27  29  13
1   1  18  12  47
2  32  12  41   0
3   8  14  12  46
4  39  48  38  17
5   4  18  36  24
6  25  17  17  40
7  33  45  37  23

In [163]:
col = ['A','B','C','D']

In [164]:
ro = ['a','b','c','d','e','f','g','h']

In [165]:
df.columns=col

In [166]:
df.index=ro

In [167]:
df

    A   B   C   D
a  32  27  29  13
b   1  18  12  47
c  32  12  41   0
d   8  14  12  46
e  39  48  38  17
f   4  18  36  24
g  25  17  17  40
h  33  45  37  23

#### at

In [168]:
df1 = df.at['a','A']

In [169]:
df1

32

In [170]:
df1=df.iat[2,1]

In [171]:
df1

12

### concat

In [172]:
#creating a dataframe

In [173]:
one = pd.DataFrame({'Name':['Alex','Amy','Allen','Alice','Ayoung','sarang'],'subject_id':['sub1','sub2','sub4','sub6','sub5','sub6'],'Marks_scored':[98,90,87,69,78,87]},index=[1,2,3,4,5,6])

two = pd.DataFrame({'Name':['Billy','Brian','Bran','Bryce','Betty'],'subject_id':['sub2','sub4','sub3','sub6','sub5'],'Marks_scored':[89,80,79,97,88]},index=[1,2,3,4,5])
 
three = pd.DataFrame({'Name':['Billy','Brian','Bran','Bryce','Betty'],'subject_id':['sub2','sub4','sub3','sub6','sub5'],'Marks_scored':[89,80,79,97,88],'roll no':[1,23,4,5,5]},index=[1,2,3,4,5])

In [174]:
one

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
6  sarang       sub6            87

In [175]:
two

    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [176]:
three

    Name subject_id  Marks_scored  roll no
1  Billy       sub2            89        1
2  Brian       sub4            80       23
3   Bran       sub3            79        4
4  Bryce       sub6            97        5
5  Betty       sub5            88        5

In [177]:
pd.concat([one,two])  #it merges the two dataframe default columnwise one above another

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
6  sarang       sub6            87
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [178]:
# pd.concat([one,three]) #it adds dataframe 3 below dataframe 1, 
# if the column of one dataframe is not present on other then 
# the coulmn will be created at that dataframe and values will be null.

In [179]:
pd.concat([one,three],keys=["x","y"])  #gives an unique identification

       Name subject_id  Marks_scored  roll no
x 1    Alex       sub1            98      NaN
  2     Amy       sub2            90      NaN
  3   Allen       sub4            87      NaN
  4   Alice       sub6            69      NaN
  5  Ayoung       sub5            78      NaN
  6  sarang       sub6            87      NaN
y 1   Billy       sub2            89      1.0
  2   Brian       sub4            80     23.0
  3    Bran       sub3            79      4.0
  4   Bryce       sub6            97      5.0
  5   Betty       sub5            88      5.0

In [180]:
pd.concat([one,two,three],keys=["x","y","z"]) #if we only give 2 keys then the third df won't be displayed

       Name subject_id  Marks_scored  roll no
x 1    Alex       sub1            98      NaN
  2     Amy       sub2            90      NaN
  3   Allen       sub4            87      NaN
  4   Alice       sub6            69      NaN
  5  Ayoung       sub5            78      NaN
  6  sarang       sub6            87      NaN
y 1   Billy       sub2            89      NaN
  2   Brian       sub4            80      NaN
  3    Bran       sub3            79      NaN
  4   Bryce       sub6            97      NaN
  5   Betty       sub5            88      NaN
z 1   Billy       sub2            89      1.0
  2   Brian       sub4            80     23.0
  3    Bran       sub3            79      4.0
  4   Bryce       sub6            97      5.0
  5   Betty       sub5            88      5.0

In [181]:
pd.concat([two,three],ignore_index=True)  #to provide a normal indexing

    Name subject_id  Marks_scored  roll no
0  Billy       sub2            89      NaN
1  Brian       sub4            80      NaN
2   Bran       sub3            79      NaN
3  Bryce       sub6            97      NaN
4  Betty       sub5            88      NaN
5  Billy       sub2            89      1.0
6  Brian       sub4            80     23.0
7   Bran       sub3            79      4.0
8  Bryce       sub6            97      5.0
9  Betty       sub5            88      5.0

In [182]:
pd.concat([one,two],axis="columns") #axis=1 # to join row wise

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2          89.0
2     Amy       sub2            90  Brian       sub4          80.0
3   Allen       sub4            87   Bran       sub3          79.0
4   Alice       sub6            69  Bryce       sub6          97.0
5  Ayoung       sub5            78  Betty       sub5          88.0
6  sarang       sub6            87    NaN        NaN           NaN

### append

In [183]:
one.append(two) #similar to concat

/tmp/ipykernel_8606/3592997046.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  one.append(two) #similar to concat

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
6  sarang       sub6            87
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [184]:
#append multiple

In [185]:
one.append([two,three])

/tmp/ipykernel_8606/1597745954.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  one.append([two,three])

     Name subject_id  Marks_scored  roll no
1    Alex       sub1            98      NaN
2     Amy       sub2            90      NaN
3   Allen       sub4            87      NaN
4   Alice       sub6            69      NaN
5  Ayoung       sub5            78      NaN
6  sarang       sub6            87      NaN
1   Billy       sub2            89      NaN
2   Brian       sub4            80      NaN
3    Bran       sub3            79      NaN
4   Bryce       sub6            97      NaN
5   Betty       sub5            88      NaN
1   Billy       sub2            89      1.0
2   Brian       sub4            80     23.0
3    Bran       sub3            79      4.0
4   Bryce       sub6            97      5.0
5   Betty       sub5            88      5.0

### merge

In [186]:
one["id"]=[1,2,3,4,5,6]

In [187]:
two["id"]=[1,2,3,4,5]

In [188]:
one

     Name subject_id  Marks_scored  id
1    Alex       sub1            98   1
2     Amy       sub2            90   2
3   Allen       sub4            87   3
4   Alice       sub6            69   4
5  Ayoung       sub5            78   5
6  sarang       sub6            87   6

In [189]:
two

    Name subject_id  Marks_scored  id
1  Billy       sub2            89   1
2  Brian       sub4            80   2
3   Bran       sub3            79   3
4  Bryce       sub6            97   4
5  Betty       sub5            88   5

In [190]:
#merge

In [191]:
pd.merge(one,two,on = "id")  #the default merge is inner join

   Name_x subject_id_x  Marks_scored_x  id Name_y subject_id_y  Marks_scored_y
0    Alex         sub1              98   1  Billy         sub2              89
1     Amy         sub2              90   2  Brian         sub4              80
2   Allen         sub4              87   3   Bran         sub3              79
3   Alice         sub6              69   4  Bryce         sub6              97
4  Ayoung         sub5              78   5  Betty         sub5              88

In [192]:
pd.merge(two,one,on = "id")    #same resut since inner join

  Name_x subject_id_x  Marks_scored_x  id  Name_y subject_id_y  Marks_scored_y
0  Billy         sub2              89   1    Alex         sub1              98
1  Brian         sub4              80   2     Amy         sub2              90
2   Bran         sub3              79   3   Allen         sub4              87
3  Bryce         sub6              97   4   Alice         sub6              69
4  Betty         sub5              88   5  Ayoung         sub5              78

In [193]:
pd.merge(one,two,on = "subject_id")

   Name_x subject_id  Marks_scored_x  id_x Name_y  Marks_scored_y  id_y
0     Amy       sub2              90     2  Billy              89     1
1   Allen       sub4              87     3  Brian              80     2
2   Alice       sub6              69     4  Bryce              97     4
3  sarang       sub6              87     6  Bryce              97     4
4  Ayoung       sub5              78     5  Betty              88     5

#### left outer join

In [194]:
pd.merge(one,two,on = "subject_id",how="left") #left outer join

   Name_x subject_id  Marks_scored_x  id_x Name_y  Marks_scored_y  id_y
0    Alex       sub1              98     1    NaN             NaN   NaN
1     Amy       sub2              90     2  Billy            89.0   1.0
2   Allen       sub4              87     3  Brian            80.0   2.0
3   Alice       sub6              69     4  Bryce            97.0   4.0
4  Ayoung       sub5              78     5  Betty            88.0   5.0
5  sarang       sub6              87     6  Bryce            97.0   4.0

#### Righr outer join

In [195]:
pd.merge(one,two,on = "subject_id",how="right") #right outer

   Name_x subject_id  Marks_scored_x  id_x Name_y  Marks_scored_y  id_y
0     Amy       sub2            90.0   2.0  Billy              89     1
1   Allen       sub4            87.0   3.0  Brian              80     2
2     NaN       sub3             NaN   NaN   Bran              79     3
3   Alice       sub6            69.0   4.0  Bryce              97     4
4  sarang       sub6            87.0   6.0  Bryce              97     4
5  Ayoung       sub5            78.0   5.0  Betty              88     5

#### Outer join

In [196]:
pd.merge(one,two,on = "subject_id",how="outer")  #all join

   Name_x subject_id  Marks_scored_x  id_x Name_y  Marks_scored_y  id_y
0    Alex       sub1            98.0   1.0    NaN             NaN   NaN
1     Amy       sub2            90.0   2.0  Billy            89.0   1.0
2   Allen       sub4            87.0   3.0  Brian            80.0   2.0
3   Alice       sub6            69.0   4.0  Bryce            97.0   4.0
4  sarang       sub6            87.0   6.0  Bryce            97.0   4.0
5  Ayoung       sub5            78.0   5.0  Betty            88.0   5.0
6     NaN       sub3             NaN   NaN   Bran            79.0   3.0

In [197]:
pd.merge(one,two,on = "subject_id",how="inner") #default join

   Name_x subject_id  Marks_scored_x  id_x Name_y  Marks_scored_y  id_y
0     Amy       sub2              90     2  Billy              89     1
1   Allen       sub4              87     3  Brian              80     2
2   Alice       sub6              69     4  Bryce              97     4
3  sarang       sub6              87     6  Bryce              97     4
4  Ayoung       sub5              78     5  Betty              88     5

### group by

In [198]:
df = pd.read_csv("http://bit.ly/drinksbycountry")

In [199]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [200]:
b=df.groupby("continent").groups

In [ ]:
b

{'Africa': [2, 4, 18, 22, 26, 27, 28, 29, 31, 33, 34, 38, 39, 47, 49, 53, 55, 56, 58, 62, 63, 66, 70, 71, 88, 95, 96, 97, 100, 101, 104, 107, 108, 114, 115, 117, 123, 124, 142, 148, 150, 152, 153, 158, 159, 162, 164, 172, 175, 179, 183, 191, 192], 'Asia': [0, 12, 13, 19, 24, 30, 36, 46, 77, 78, 79, 80, 82, 85, 86, 87, 90, 91, 92, 94, 102, 103, 112, 116, 119, 127, 128, 134, 137, 138, 141, 149, 154, 161, 167, 168, 169, 171, 176, 177, 181, 186, 189, 190], 'Europe': [1, 3, 7, 9, 10, 15, 16, 21, 25, 42, 44, 45, 48, 57, 60, 61, 64, 65, 67, 75, 76, 81, 83, 93, 98, 99, 105, 111, 113, 120, 126, 135, 136, 139, 140, 147, 151, 155, 156, 160, 165, 166, 170, 180, 182], 'North America': [5, 11, 14, 17, 32, 41, 43, 50, 51, 54, 68, 69, 73, 74, 84, 109, 122, 130, 143, 144, 145, 174, 184], 'Oceania': [8, 40, 59, 89, 106, 110, 118, 121, 125, 129, 131, 146, 157, 173, 178, 187], 'South America': [6, 20, 23, 35, 37, 52, 72, 132, 133, 163, 185, 188]}

In [201]:
import numpy as np
import pandas as pd
ipl_data  = {'Team':['Riders','Riders','Devils','Devils','Kings','kings','Kings','Kings','Riders','Royals','Royals','Riders'],'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
ipl_data

{'Team': ['Riders',
  'Riders',
  'Devils',
  'Devils',
  'Kings',
  'kings',
  'Kings',
  'Kings',
  'Riders',
  'Royals',
  'Royals',
  'Riders'],
 'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
 'Year': [2014,
  2015,
  2014,
  2015,
  2014,
  2015,
  2016,
  2017,
  2016,
  2014,
  2015,
  2017],
 'Points': [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]}

In [202]:
df = pd.DataFrame(ipl_data)

In [203]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [204]:
df.groupby("Team").groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [205]:
df.groupby(["Team","Year"]).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [206]:
df.groupby("Team").Points.sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [207]:
df.groupby('Team').Points.max()

Team
Devils    863
Kings     788
Riders    876
Royals    804
kings     812
Name: Points, dtype: int64

### reindexing of index

In [208]:
#creating a dataframe from numpy

In [209]:
import pandas as pd
import numpy as np

In [210]:
data = np.random.rand(5,3)

In [211]:
data

array([[0.86788443, 0.62432178, 0.09393163],
       [0.41786524, 0.20512248, 0.71462833],
       [0.67789882, 0.98145589, 0.188052  ],
       [0.14250556, 0.06144835, 0.23123766],
       [0.92359803, 0.34247148, 0.61241664]])

In [212]:
df = pd.DataFrame(data,index=['a','b','c','d','e'],columns=['A','B','C'])

In [213]:
a=df.reindex(['a','b','c','d','e','f','g'])
a

          A         B         C
a  0.867884  0.624322  0.093932
b  0.417865  0.205122  0.714628
c  0.677899  0.981456  0.188052
d  0.142506  0.061448  0.231238
e  0.923598  0.342471  0.612417
f       NaN       NaN       NaN
g       NaN       NaN       NaN

In [214]:
#to check any null values exist

### null value handeling

In [215]:
#the number of null values per column

x=a.isnull().sum()

x

A    2
B    2
C    2
dtype: int64

In [216]:
#if the number of null value present in column

a.isnull().any().sum()

3

In [217]:
#same as isnull 

b=a.isna().any()  #returns a boolean answerdfa

In [218]:
b=a.isna().all()  #if each columns are null or not

print(b)

a.isna().any().sum()  #if null value exists in col reurns 1 and adds with other cols

A    False
B    False
C    False
dtype: bool

3

In [219]:
#to find the percentage of null values in each columns

b=a.isna().sum()  #avoid any() to get column wise count of null and assigning it to a variable
print(b)

'''percentage per column=(no.of nul values per column)/(total no. of elements in column)'''

c = (b/len(a))*100
print(c)

'''percentage of null values per column is 28.57'''

A    2
B    2
C    2
dtype: int64
A    28.571429
B    28.571429
C    28.571429
dtype: float64

'percentage of null values per column is 28.57'

In [220]:
# creating a dataframe

df = pd.DataFrame(data,index=['a','b','c','d','e'],columns=['A','B','C'])

a=df.reindex(['a','b','c','d','e','f','g'])

print(a.head())

          A         B         C
a  0.867884  0.624322  0.093932
b  0.417865  0.205122  0.714628
c  0.677899  0.981456  0.188052
d  0.142506  0.061448  0.231238
e  0.923598  0.342471  0.612417

In [221]:
#to find the number of null values per column of the dataframe

a['A'].isnull().sum()

2

In [222]:
# to find the values that are not null per column

a['A'].notnull().sum()

5

#### fill null

In [223]:
'''Fill null is used to fill the void values in  the dataset with user defined values'''

b=a.fillna(0)   #this will fill the dataframe a's void values with 0
b

          A         B         C
a  0.867884  0.624322  0.093932
b  0.417865  0.205122  0.714628
c  0.677899  0.981456  0.188052
d  0.142506  0.061448  0.231238
e  0.923598  0.342471  0.612417
f  0.000000  0.000000  0.000000
g  0.000000  0.000000  0.000000

In [224]:
c =a.fillna(5)
c

          A         B         C
a  0.867884  0.624322  0.093932
b  0.417865  0.205122  0.714628
c  0.677899  0.981456  0.188052
d  0.142506  0.061448  0.231238
e  0.923598  0.342471  0.612417
f  5.000000  5.000000  5.000000
g  5.000000  5.000000  5.000000

### '''creating Data framne from csv files'''

In [225]:
df = pd.read_csv("expor_dataframe.csv")
df

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    NaN        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4

In [226]:
df.isnull() #to check weather the daaframe has null values or not

   Label  maths  english
0  False  False    False
1  False   True    False
2  False  False    False
3  False   True    False

In [227]:
df.isnull().any().sum()

1

In [228]:
df.isnull().sum()  #retuns exact num of void values per column

Label      0
maths      2
english    0
dtype: int64

In [229]:
'''filling a DF with mean of the total values in the column so that the overall mean does not change'''

'filling a DF with mean of the total values in the column so that the overall mean does not change'

In [230]:
a=df['maths'].mean()
a

5.0

In [231]:
df.fillna(a) #the original Df is not affected since we didntgive inplace = True

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    5.0        6
2         ARTS    7.0        8
3    MALAYALAM    5.0        4

In [232]:
df.maths.mean()
df

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    NaN        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4

In [233]:
b = df.maths.median()
b

5.0

In [234]:
df.fillna(b)

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    5.0        6
2         ARTS    7.0        8
3    MALAYALAM    5.0        4

### null value handling in dataframe

In [235]:
import pandas as pd 

df = pd.read_csv('expor_dataframe.csv')

df

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    NaN        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4

In [236]:
#removing the row of null values. not recomended. valueable data lost

data=df.dropna()

print(data)

         Label  maths  english
0  ENGINEERING    3.0        4
2         ARTS    7.0        8

In [237]:
#forward fill and backward fill

print(df.head())

data1 = df.backfill()

print(data1)

data1.isna().any()

data2 = data1.ffill()

print(data2)

data2.isna().any

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    NaN        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4
         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    7.0        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4
         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    7.0        6
2         ARTS    7.0        8
3    MALAYALAM    7.0        4

<bound method NDFrame._add_numeric_operations.<locals>.any of    Label  maths  english
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False>

### read csv

In [238]:
df = pd.read_csv('expor_dataframe.csv')

df

         Label  maths  english
0  ENGINEERING    3.0        4
1         MBBS    NaN        6
2         ARTS    7.0        8
3    MALAYALAM    NaN        4

In [239]:
#to skip rows

df = pd.read_csv('expor_dataframe.csv',skiprows=2)

df

        MBBS  Unnamed: 1  6
0       ARTS         7.0  8
1  MALAYALAM         NaN  4

In [240]:
import numpy as np

#to change the data type of the column in csv file

df = pd.read_csv('expor_dataframe.csv',dtype={'english':np.float})

df

/tmp/ipykernel_8606/2363179023.py:5: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df = pd.read_csv('expor_dataframe.csv',dtype={'english':np.float})

         Label  maths  english
0  ENGINEERING    3.0      4.0
1         MBBS    NaN      6.0
2         ARTS    7.0      8.0
3    MALAYALAM    NaN      4.0

In [241]:
df = pd.read_csv('expor_dataframe.csv',names=list('abcd'))

df

             a      b        c   d
0        Label  maths  english NaN
1  ENGINEERING      3        4 NaN
2         MBBS    NaN        6 NaN
3         ARTS      7        8 NaN
4    MALAYALAM    NaN        4 NaN

In [242]:
df = pd.read_csv('expor_dataframe.csv',names=list('abc'),header=0)   #do not give extra null column

df

             a    b  c
0  ENGINEERING  3.0  4
1         MBBS  NaN  6
2         ARTS  7.0  8
3    MALAYALAM  NaN  4

In [243]:
df = pd.read_csv('expor_dataframe.csv',usecols=['Label','maths']) #to display specific cols

df

         Label  maths
0  ENGINEERING    3.0
1         MBBS    NaN
2         ARTS    7.0
3    MALAYALAM    NaN

In [244]:
df = pd.DataFrame(np.random.randint(50,size=(5,3)))

df

    0   1   2
0   2  21  26
1  22  24  38
2  10  46  21
3  16  14   2
4   1  12  36

In [245]:
data=df.to_csv('students.csv')

df=pd.read_csv('students.csv')

df

   Unnamed: 0   0   1   2
0           0   2  21  26
1           1  22  24  38
2           2  10  46  21
3           3  16  14   2
4           4   1  12  36